Revit 2027 API
IFCExtrusionData.ClearLoops Method
 Clears the curve loops stored in the extrusion data.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearLoops()
Public Sub ClearLoops
public:
void ClearLoops()
member ClearLoops : unit -> unit
See Also
Reference
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace